package com.czxy;

import java.util.Random;

/**
 * Created by ASUS on 2020/5/16.
 */
public class add1 {
    public static void main(String[] args) {
//        //英雄重做
//        String[] str={"白起","刘备","孙悟空","钟馗","八神庵(SNK)","张飞","乌尔奇奥拉(死神)",
//                      "杨玉环","弗雷尔","西施","墨子","小龙女","小白龙","刘邦","黄月英","项羽","牛魔","钟无艳","孙权","庄周","商羊","廉颇","甘宁","云中君","参水猿","盘古","白(火影)","毕月乌","上官婉儿","吕蒙"};
//        //周年限定
//        String[] str={"白起","刘备","嬴政","孙悟空","蓝染(死神)","武则天","凡尔斯","狄仁杰","唐三藏","钟馗","我爱罗(火影)","关羽","李白","猪八戒","程咬金","托鲁克","八神庵(SNK)","秦琼","沙悟净","罗成","芈月",
//                      "乌尔奇奥拉(死神)","嫦娥","李世民","诸葛亮","杨玉环","后裔","凯(火影)","王昭君","弗雷尔","西施","哪吒","老夫子","草薙京(SNK)","赵云","墨子","杨戬","鲁班大师","马超","浮竹十四郎(死神)","花木兰","小龙女",
//                      "东皇太一","皮特萨拉罗","太乙真人","角都(火影)","小白龙","刘邦","黄月英","项羽","牛魔","伊格尼斯(SNK)","钟无艳","孙权","庄周","商羊","廉颇","凤桥楼十郎(死神)","甘宁","云中君","参水猿","托鲁斯",
//                      "白(火影)","露娜","毕月乌","上官婉儿","吕蒙"};
//        //赛季皮肤
//        String[] str={"雅典娜","白起","嬴政","孙悟空","蓝染(死神)","武则天","凡尔斯","狄仁杰","钟馗","我爱罗(火影)","关羽","李白","猪八戒","程咬金","托鲁克","八神庵(SNK)","秦琼","沙悟净","罗成","芈月",
//                      "乌尔奇奥拉(死神)","嫦娥","李世民","诸葛亮","杨玉环","凯(火影)","王昭君","弗雷尔","西施","老夫子","草薙京(SNK)","赵云","墨子","杨戬","鲁班大师","马超","花木兰","小龙女",
//                      "东皇太一","皮特萨拉罗","太乙真人","小白龙","刘邦","黄月英","项羽","牛魔","伊格尼斯(SNK)","钟无艳","孙权","庄周","商羊","廉颇","凤桥楼十郎(死神)","甘宁","云中君","参水猿","盘古","托鲁斯","白(火影)",
//                      "露娜","毕月乌","上官婉儿","吕蒙"};
        //荣耀典藏皮肤
        String[] str={"雅典娜","白起","刘备","嬴政","孙悟空","武则天","凡尔斯","狄仁杰","唐三藏","钟馗","我爱罗(火影)","关羽","李白","猪八戒","托鲁克","秦琼","沙悟净","罗成","张飞",
                      "乌尔奇奥拉(死神)","嫦娥","李世民","杨玉环","后裔","凯(火影)","王昭君","弗雷尔","西施","哪吒","赵云","墨子","杨戬","鲁班大师","马超","浮竹十四郎(死神)","花木兰","小龙女","东皇太一","皮特萨拉罗",
                      "太乙真人","角都(火影)","小白龙","刘邦","项羽","牛魔","钟无艳","孙权","庄周","商羊","廉颇","凤桥楼十郎(死神)","甘宁","云中君","盘古","托鲁斯","白(火影)","毕月乌","上官婉儿","吕蒙"};
//        //战队赛限定
//        String[] str={"雅典娜","白起","刘备","嬴政","孙悟空","蓝染(死神)","武则天","凡尔斯","狄仁杰","唐三藏","钟馗","我爱罗(火影)","关羽","李白","程咬金","托鲁克","八神庵(SNK)","沙悟净","罗成","张飞","芈月",
//                      "乌尔奇奥拉(死神)","李世民","诸葛亮","杨玉环","后裔","王昭君","弗雷尔","西施","哪吒","老夫子","草薙京(SNK)","赵云","墨子","鲁班大师","马超","浮竹十四郎(死神)","花木兰","东皇太一",
//                      "皮特萨拉罗","太乙真人","角都(火影)","小白龙","刘邦","黄月英","项羽","牛魔","伊格尼斯(SNK)","钟无艳","孙权","庄周","商羊","廉颇","凤桥楼十郎(死神)","甘宁","云中君","参水猿","盘古","托鲁斯","白(火影)",
//                      "露娜","毕月乌","上官婉儿","吕蒙"};
        Random r=new Random();
        int s =r.nextInt(str.length);
        System.out.println(str[s]);
    }
}
