package com.czxy;

import java.util.Random;

/**
 * Created by ASUS on 2020/5/16.
 */
public class add3 {
    public static void main(String[] args) {
//        //生肖限定
//        String[] str={"雅典娜","嬴政","蓝染(死神)","武则天","凡尔斯","唐三藏","钟馗","我爱罗(火影)","关羽","李白","猪八戒","程咬金","秦琼","沙悟净","罗成","张飞","芈月","乌尔奇奥拉(死神)",
//                      "嫦娥","李世民","诸葛亮","杨玉环","后裔","凯(火影)","王昭君","弗雷尔","哪吒","老夫子","赵云","墨子","杨戬","鲁班大师","马超","浮竹十四郎(死神)","花木兰","小龙女","东皇太一","皮特萨拉罗","太乙真人",
//                      "角都(火影)","小白龙","刘邦","黄月英","项羽","牛魔","伊格尼斯(SNK)","钟无艳","孙权","庄周","商羊","廉颇","凤桥楼十郎(死神)","甘宁","云中君","参水猿","盘古","托鲁斯","白(火影)","露娜","毕月乌","上官婉儿",
//                      "吕蒙"};
//        //情人节限定
//        String[] str={"白起","刘备","嬴政","孙悟空","武则天","狄仁杰","唐三藏","钟馗","关羽","李白","猪八戒","程咬金","托鲁克","八神庵(SNK)","秦琼","沙悟净","罗成","芈月","乌尔奇奥拉(死神)",
//                      "李世民","杨玉环","后裔","凯(火影)","王昭君","弗雷尔","西施","哪吒","草薙京(SNK)","赵云","杨戬","鲁班大师","浮竹十四郎(死神)","花木兰","小龙女","东皇太一","皮特萨拉罗","太乙真人",
//                      "小白龙","刘邦","黄月英","项羽","牛魔","伊格尼斯(SNK)","钟无艳","孙权","庄周","商羊","廉颇","凤桥楼十郎(死神)","甘宁","云中君","参水猿","盘古","托鲁斯","白(火影)","露娜","上官婉儿","吕蒙"};
//        //女神节皮肤
//        String[] str={"芈月","嫦娥","杨玉环","王昭君","西施","花木兰","小龙女","皮特萨拉罗","黄月英","钟无艳","白(火影)","露娜","上官婉儿"};
//        //清明节皮肤
//        String[] str={"雅典娜","白起","刘备","嬴政","孙悟空","蓝染(死神)","武则天","凡尔斯","狄仁杰","钟馗","关羽","李白","猪八戒","程咬金","托鲁克","八神庵(SNK)","秦琼","沙悟净","罗成","张飞","芈月",
//                      "乌尔奇奥拉(死神)","嫦娥","李世民","诸葛亮","杨玉环","后裔","凯(火影)","王昭君","弗雷尔","西施","哪吒","老夫子","草薙京(SNK)","赵云","墨子","杨戬","鲁班大师","马超","浮竹十四郎(死神)","花木兰","小龙女",
//                      "东皇太一","皮特萨拉罗","太乙真人","角都(火影)","小白龙","刘邦","黄月英","项羽","牛魔","伊格尼斯(SNK)","钟无艳","孙权","庄周","商羊","廉颇","凤桥楼十郎(死神)","甘宁","云中君","参水猿","盘古","托鲁斯" ,
//                      "白(火影)","露娜","毕月乌","上官婉儿","吕蒙"};
        //五五开黑节皮肤
        String[] str={"雅典娜","白起","刘备","嬴政","孙悟空","蓝染(死神)","武则天","狄仁杰","唐三藏","我爱罗(火影)","关羽","李白","猪八戒","程咬金","托鲁克","八神庵(SNK)","秦琼","沙悟净","罗成","张飞","芈月",
                      "乌尔奇奥拉(死神)","嫦娥","李世民","诸葛亮","杨玉环","后裔","凯(火影)","王昭君","弗雷尔","西施","哪吒","老夫子","草薙京(SNK)","赵云","墨子","杨戬","鲁班大师","马超","浮竹十四郎(死神)","花木兰","小龙女",
                      "东皇太一","皮特萨拉罗","太乙真人","角都(火影)","小白龙","刘邦","黄月英","项羽","牛魔","伊格尼斯(SNK)","钟无艳","孙权","庄周","商羊","廉颇","凤桥楼十郎(死神)","甘宁","云中君","参水猿","盘古","托鲁斯",
                      "白(火影)","露娜","毕月乌","上官婉儿","吕蒙"};
        Random r=new Random();
        int s =r.nextInt(str.length);
        System.out.println(str[s]);
    }
}
