package com.czxy;

import java.util.Random;

/**
 * Created by ASUS on 2020/5/16.
 */
public class add4 {
    public static void main(String[] args) {
//        //暑期皮肤
//        String[] str={"雅典娜","白起","刘备","嬴政","孙悟空","蓝染(死神)","武则天","凡尔斯","狄仁杰","唐三藏","钟馗","我爱罗(火影)","李白","猪八戒","程咬金","托鲁克","八神庵(SNK)","秦琼","沙悟净","张飞","芈月",
//                      "乌尔奇奥拉(死神)","嫦娥","李世民","诸葛亮","杨玉环","凯(火影)","王昭君","弗雷尔","西施","哪吒","老夫子","草薙京(SNK)","赵云","墨子","杨戬","鲁班大师","马超","小龙女",
//                      "东皇太一","皮特萨拉罗","太乙真人","角都(火影)","小白龙","黄月英","项羽","牛魔","钟无艳","孙权","庄周","商羊","廉颇","凤桥楼十郎(死神)","甘宁","云中君","参水猿","盘古","托鲁斯","白(火影)","露娜",
//                      "毕月乌","上官婉儿","吕蒙"};
//        //圣诞节限定
//        String[] str={"雅典娜","白起","刘备","嬴政","孙悟空","蓝染(死神)","武则天","凡尔斯","唐三藏","钟馗","我爱罗(火影)","关羽","李白","猪八戒","程咬金","托鲁克","八神庵(SNK)","秦琼","沙悟净","罗成","张飞","芈月",
//                      "乌尔奇奥拉(死神)","嫦娥","李世民","诸葛亮","杨玉环","后裔","凯(火影)","王昭君","弗雷尔","西施","哪吒","老夫子","草薙京(SNK)","赵云","墨子","杨戬","鲁班大师","马超","浮竹十四郎(死神)","花木兰",
//                      "东皇太一","皮特萨拉罗","太乙真人","角都(火影)","小白龙","刘邦","黄月英","项羽","牛魔","钟无艳","孙权","庄周","商羊","廉颇","凤桥楼十郎(死神)","甘宁","云中君","参水猿","盘古","托鲁斯","白(火影)","露娜",
//                      "毕月乌","上官婉儿","吕蒙"};
        //星座
        String[] str={"白起","嬴政","狄仁杰","唐三藏","我爱罗(火影)","沙悟净","罗成","芈月","乌尔奇奥拉(死神)","李世民","诸葛亮","杨玉环","后裔","王昭君",
                      "西施","老夫子","草薙京(SNK)","赵云","墨子","杨戬","鲁班大师","浮竹十四郎(死神)","花木兰","东皇太一","皮特萨拉罗","小白龙","刘邦","黄月英","项羽","牛魔",
                      "钟无艳","孙权","庄周","商羊","廉颇","凤桥楼十郎(死神)","甘宁","云中君","参水猿","盘古","托鲁斯","白(火影)","露娜","毕月乌","上官婉儿","吕蒙"};
//        //节气
//        String[] str={"八神庵(SNK)","嫦娥","诸葛亮","凯(火影)","杨戬","浮竹十四郎(死神)","花木兰","小龙女","皮特萨拉罗","小白龙",
//                      "黄月英","项羽","牛魔","钟无艳","孙权","廉颇","凤桥楼十郎(死神)","甘宁","参水猿","盘古","托鲁斯","露娜","毕月乌","上官婉儿","吕蒙"};
//        //最强刺客
//        String[] str={"蓝染(死神)","杨玉环","芈月","花木兰","嫦娥","刘邦","黄月英","牛魔","盘古"};
        Random r=new Random();
        int s =r.nextInt(str.length);
        System.out.println(str[s]);
    }
}
